# Tarefa 02 Módulo 05

O nosso projeto desta sequência de módulos do curso será um aprofundamento da demonstração sobre classificação de risco de crédito que vimos lá no comecinho. Pois recebemos uma base já montada pra nós. Tenha certeza de que ela passou por um longo processamento até ficar daquele jeito. Neste exercício vamos exercitar o que aprendemos nas ultimas aulas e montar a variável resposta da base do nosso projeto.

#### Marcação de bom e mau
O objetivo da modelagem é classificar o risco de inadimplência, ou como se diz no meio, o risco de *default*. Podemos fazer longas discussões sobre o conceito de *default* com base em estudos e exigências regulatórias, para efeitos deste estudo, um cliente em *default* é aquele que está em 60 dias de atraso ou mais. Então classificaremos os clientes como 'bons' e 'maus' assim:
- **Maus** pagadores: são aqueles que entraram em 'default' (atraso 60 dias ou mais) nos 24 meses seguintes à aquisição do cartão de crédito. 
- **Bons** pagadores: são considerados todos os demais.
- **Excluídos**: Clientes que não adquiriram um cartão de crédito (seja por recusa, seja por desistência) não possuem informações de pagamento, portanto não se pode identificar se são bons ou maus. Há uma longa discussão e literatura sobre *inferência de rejeitados* que está fora do escopo deste exercício.

#### Bases disponíveis
Temos duas bases importantes aqui: uma de propostas, com diversas informações dos vários solicitantes de cartão de crédito, e uma base de pagamentos. A base de pagamentos será utilizada para identificar a ocorrência de *default*. A base de propostas tem diversas informações coletadas no momento da solicitação do crédito (isto é importante: qualquer informação posterior a essa data é impossível de ser coletada na aplicação do modelo e não pode ser utilizada).

As variáveis delas são:

Base de propostas - application_records.csv

| Nome da Variável         | Description                                         | Tipo  |
| ------------------------ |:---------------------------------------------------:| -----:|
| ID| identificador do cliente (chave) |inteiro|
| CODE_GENDER| M = 'Masculino'; F = 'Feminino' |M/F|
| FLAG_OWN_CAR| Y = 'possui'; N = 'não possui' |Y/N|
| FLAG_OWN_REALTY| Y = 'possui'; N = 'não possui' |Y/N|
| CNT_CHILDREN| Quantidade de filhos |inteiro|
| AMT_INCOME_TOTAL| Annual income |inteiro|
| NAME_INCOME_TYPE|Tipo de renda (ex: assaliariado, autônomo etc) | texto |
| NAME_EDUCATION_TYPE| Nível de educação (ex: secundário, superior etc) |texto|
| NAME_FAMILY_STATUS | Estado civil (ex: solteiro, casado etc)| texto |
| NAME_HOUSING_TYPE | tipo de residência (ex: casa/apartamento, com os pais etc) | texto |
| DAYS_BIRTH | Count backwards from current day (0), -1 means yesterday |inteiro|
| DAYS_EMPLOYED | Count backwards from current day (0), -1 means yesterday |inteiro|
| FLAG_MOBIL | Indica se possui celular (1 = sim, 0 = não) |binária|
| FLAG_WORK_PHONE | Indica se possui telefone comercial (1 = sim, 0 = não) |binária|
| FLAG_PHONE | Indica se possui telefone (1 = sim, 0 = não) |binária|
| FLAG_EMAIL | Indica se possui e-mail (1 = sim, 0 = não) |binária|
| OCCUPATION_TYPE | Occupation	 |Qualitativa|
| CNT_FAM_MEMBERS | quantidade de pessoas na residência |inteiro|

Base de pagamentos - pagamentos_largo.csv  

| Nome da Variável         | Description                                         | Tipo  |
| ------------------------ |:---------------------------------------------------:| -----:|
| ID| identificador do cliente (chave) |inteiro|
| mes_00 a mes_24| faixa de atraso mês a mês do cliente <br>0: 1-29 days past due &nbsp;&nbsp;&nbsp;&nbsp; 1: 30-59 days past due <br />2: 60-89 days overdue &nbsp;&nbsp;&nbsp;&nbsp; 3: 90-119 days overdue <br /> 4: 120-149 days overdue &nbsp;&nbsp;&nbsp;&nbsp; 5: more than 150 days <br />C: paid off that month &nbsp;&nbsp;&nbsp;&nbsp; X: No loan for the month |Qualitativa|

#### Construindo a variável resposta
A base de pagamentos está em um formato de 'base larga'. Essa base possui informações de pagamentos do cliente mês a mês a partir do mês de aquisição do crédito (mês 0) até o vigésimo quarto mês após a aquisição do crédito (mês 24). Utilizaremos essa base para determinar se um proponente é considerado 'bom pagador' ou caso apresente atraso representativo, será considerado 'mau pagador'.

#### Base larga vs base longa
A base ser larga significa que há uma linha para cada cliente, e que as informações estarão nas colunas, em contraste com a 'base longa', em que haveria uma linha para cada combinação cliente/mês, uma coluna indicando o cliente, outra indicando o mês, e apenas uma coluna com a informação do atraso.

#### Tarefa 1) Marcar *default* no mês
Faça uma indicadora de se o cliente está em *default* em cada uma das marcações (mes_00 a mes_24). Dica: você pode utilizar o método ```.isin()``` do Pandas. Consulte a [documentação](https://pandas.pydata.org/pandas-docs/stable/reference/api/pandas.DataFrame.isin.html) caso necessário.

#### Tarefa 2) 'bons' e 'maus' ao longo de todos os 24 meses de desempenho
Marque para cada cliente se ele teve pelo menos um episódio de *default* entre o mês 0 e o mês 24. Dica: o método ```sum()``` pode ajudar. Caso precise, consulte a [documentação](https://pandas.pydata.org/docs/reference/api/pandas.DataFrame.sum.html) e procure pelo argumento ```axis```, você viu outros métodos que possuem esse argumento também. Tendo o número de meses em default de cada cliente, basta marcar ```True``` para todos aqueles que possuem pelo menos 1 mês em *default* e ```False``` para os demais.

#### Tarefa 3) Marcando proponentes expostos ao risco de crédito
Marcando proponentes que se tornaram tomadores: lembre-se de que clientes que não adquiriram o cartão devem ser desconsiderados. A base de pagamentos possui apenas clientes que adquiriram cartão de crédito, então você pode selecionar somente os clientes da base de propostas que se encontram na base de pagamentos.

#### Tarefa 4) Consolidando as informações
Faça uma junção das informações da base de propostas com a variável de *default* que você acabou de construir. Talvez você consiga realizar a tarefa 3 e tarefa 4 em uma única linha de código ;)

#### Tarefa 5) Verificando
Faça uma contagem dos valores do *default* que você construiu.

In [1]:
import pandas as pd

In [9]:
propostas.head()

,ID,CODE_GENDER,FLAG_OWN_CAR,FLAG_OWN_REALTY,CNT_CHILDREN,AMT_INCOME_TOTAL,NAME_INCOME_TYPE,NAME_EDUCATION_TYPE,NAME_FAMILY_STATUS,NAME_HOUSING_TYPE,DAYS_BIRTH,DAYS_EMPLOYED,FLAG_MOBIL,FLAG_WORK_PHONE,FLAG_PHONE,FLAG_EMAIL,OCCUPATION_TYPE,CNT_FAM_MEMBERS
0,5008804,M,Y,Y,0,427500.0,Working,Higher education,Civil marriage,Rented apartment,-12005,-4542,1,1,0,0,NaN,2.0
1,5008805,M,Y,Y,0,427500.0,Working,Higher education,Civil marriage,Rented apartment,-12005,-4542,1,1,0,0,NaN,2.0
2,5008806,M,Y,Y,0,112500.0,Working,Secondary / secondary special,Married,House / apartment,-21474,-1134,1,0,0,0,Security staff,2.0
3,5008808,F,N,Y,0,270000.0,Commercial associate,Secondary / secondary special,Single / not married,House / apartment,-19110,-3051,1,0,1,1,Sales staff,1.0
4,5008809,F,N,Y,0,270000.0,Commercial associate,Secondary / secondary special,Single / not married,House / apartment,-19110,-3051,1,0,1,1,Sales staff,1.0

In [2]:
propostas = pd.read_csv('application_record.csv')
pl = pd.read_csv('pagamentos_largo.csv')
pl.head()

,ID,mes_0,mes_1,mes_10,mes_11,mes_12,mes_13,mes_14,mes_15,mes_16,...,mes_22,mes_23,mes_24,mes_3,mes_4,mes_5,mes_6,mes_7,mes_8,mes_9
0,5001718,0,0,0,0,0,0,0,0,NaN,...,NaN,0,NaN,0,0,0,0,NaN,0,NaN
1,5001719,0,0,C,C,C,C,C,C,C,...,C,C,C,C,C,C,C,C,C,C
2,5001720,0,0,0,0,0,0,0,0,0,...,1,0,0,0,0,0,0,0,0,0
3,5001723,0,0,NaN,NaN,NaN,NaN,NaN,NaN,NaN,...,NaN,NaN,NaN,0,0,0,0,0,NaN,NaN
4,5001726,0,0,C,C,C,C,C,C,C,...,C,C,C,0,0,0,C,C,C,C

In [19]:
pg2 = pl.copy()

In [32]:
pg2["default"] = pg2.isin(['2', '3', '4', '5']).sum(axis=1)

In [37]:
pg2.default.value_counts()

0     20506
1       175
2        69
3        48
4        28
6        19
5        17
12       13
8        10
10        7
18        6
15        5
13        4
20        4
9         4
7         4
14        4
24        3
19        3
11        3
16        2
17        2
23        1
Name: default, dtype: int64

In [55]:
p = propostas.merge(pg2, on='ID', how='right')
p

,ID,CODE_GENDER,FLAG_OWN_CAR,FLAG_OWN_REALTY,CNT_CHILDREN,AMT_INCOME_TOTAL,NAME_INCOME_TYPE,NAME_EDUCATION_TYPE,NAME_FAMILY_STATUS,NAME_HOUSING_TYPE,...,mes_23,mes_24,mes_3,mes_4,mes_5,mes_6,mes_7,mes_8,mes_9,default
0,5001718,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,...,0,NaN,0,0,0,0,NaN,0,NaN,0
1,5001719,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,...,C,C,C,C,C,C,C,C,C,0
2,5001720,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,...,0,0,0,0,0,0,0,0,0,0
3,5001723,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,...,NaN,NaN,0,0,0,0,0,NaN,NaN,0
4,5001726,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,...,C,C,0,0,0,C,C,C,C,0
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
20932,5150475,M,Y,Y,0.0,202500.0,Working,Secondary / secondary special,Civil marriage,House / apartment,...,C,C,C,C,C,C,C,C,C,0
20933,5150476,M,Y,Y,0.0,202500.0,Working,Secondary / secondary special,Civil marriage,House / apartment,...,NaN,NaN,0,0,0,0,0,0,0,0
20934,5150480,F,Y,Y,1.0,157500.0,Working,Secondary / secondary special,Married,House / apartment,...,C,C,0,0,0,C,C,C,C,0
20935,5150482,F,Y,Y,1.0,157500.0,Working,Secondary / secondary special,Married,House / apartment,...,NaN,NaN,0,0,0,0,0,0,0,0
20936,5150487,M,Y,N,0.0,202500.0,Working,Secondary / secondary special,Married,House / apartment,...,C,C,C,C,C,C,C,C,C,0

In [47]:
propostas.merge(pg2, on='ID', how='right').value_counts()

ID       CODE_GENDER  FLAG_OWN_CAR  FLAG_OWN_REALTY  CNT_CHILDREN  AMT_INCOME_TOTAL  NAME_INCOME_TYPE      NAME_EDUCATION_TYPE            NAME_FAMILY_STATUS  NAME_HOUSING_TYPE  DAYS_BIRTH  DAYS_EMPLOYED  FLAG_MOBIL  FLAG_WORK_PHONE  FLAG_PHONE  FLAG_EMAIL  OCCUPATION_TYPE  CNT_FAM_MEMBERS  mes_0  mes_1  mes_10  mes_11  mes_12  mes_13  mes_14  mes_15  mes_16  mes_17  mes_18  mes_19  mes_2  mes_20  mes_21  mes_22  mes_23  mes_24  mes_3  mes_4  mes_5  mes_6  mes_7  mes_8  mes_9  default
5008825  F            Y             N                0.0           130500.0          Working               Incomplete higher              Married             House / apartment  -10669.0    -1103.0        1.0         0.0              0.0         0.0         Accountants      2.0              0      0      0       0       0       0       0       0       0       0       0       0       0      0       0       0       0       0       0      0      1      0      0      0      0      0          1
5105171  M            N             Y                2.0           450000.0          Commercial associate  Higher education               Married             House / apartment  -12238.0    -2187.0        1.0         1.0              1.0         0.0         Managers         4.0              0      0      C       C       C       C       C       C       C       C       C       C       0      C       C       C       C       C       0      0      C      C      C      C      C      0          1
5105169  M            N             Y                2.0           450000.0          Commercial associate  Higher education               Married             House / apartment  -12238.0    -2187.0        1.0         1.0              1.0         0.0         Managers         4.0              0      0      C       C       C       C       C       C       C       C       C       C       0      C       C       C       C       C       0      0      C      C      C      C      C      0          1
5105168  M            N             Y                2.0           450000.0          Commercial associate  Higher education               Married             House / apartment  -12238.0    -2187.0        1.0         1.0              1.0         0.0         Managers         4.0              0      0      0       C       C       C       C       C       C       C       C       C       0      C       C       C       C       C       0      0      0      0      0      0      0      0          1
5105166  M            N             Y                2.0           450000.0          Commercial associate  Higher education               Married             House / apartment  -12238.0    -2187.0        1.0         1.0              1.0         0.0         Managers         4.0              0      0      0       C       C       C       C       C       C       C       C       C       0      C       C       C       C       C       0      0      0      0      0      0      0      0          1
                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                           ..
5053553  M            Y             Y                1.0           193500.0          Working               Secondary / secondary special  Married             House / apartment  -10439.0    -2250.0        1.0         1.0              0.0         0.0         Core staff       3.0              0      0      0       0       C       C       C       C       C       C       C       C       0      C       C       C       C       C       0      0      0      0      0      0      0      0          1
5053550  M            Y             Y                1.0           193500.0          Working               Secondary / secondary special  Married             House / apartment  -10439.0    -2250.0        1.0         1.0              0.0         0.0         Core staff       3.0              0      0      0       0       C       C       C       C       C       C       C       C       0      C       C       C       C       C       0      0      0      0      0      0      0      0          1
5053548  M            Y             Y                0.0           135000.0          Working               Secondary / secondary special  Married             House / apartment  -21065.0    -1458.0        1.0         0.0              1.0         0.0         Laborers         2.0              0      0      C       C       C       C       C       C       C       C       C       C       0      C       C       C       C       C       C      C      C      C      C      C      C      0          1
5053545  M            Y             Y                0.0           135000.0          Working               Secondary / secondary special  Married             House / apartment  -21065.0    -1458.0        1.0         0.0              1.0         0.0         Laborers         2.0              0      0      0       0       0       0       0       0       0       0       0       0       0      0       0       0       0       0       0      0      0      0      0      0      0      0          1
5150487  M            Y             N                0.0           202500.0          Working               Secondary / secondary special  Married             House / apartment  -19398.0    -2166.0        1.0         0.0              0.0         0.0         Drivers          2.0              C      C      C       C       C       C       C       C       C       C       C       C       C      C       C       C       C       C       C      C      C      C      C      C      C      0          1
Length: 6334, dtype: int64

In [51]:
propostas.merge(pg2, on='ID', how='left')

,ID,CODE_GENDER,FLAG_OWN_CAR,FLAG_OWN_REALTY,CNT_CHILDREN,AMT_INCOME_TOTAL,NAME_INCOME_TYPE,NAME_EDUCATION_TYPE,NAME_FAMILY_STATUS,NAME_HOUSING_TYPE,...,mes_23,mes_24,mes_3,mes_4,mes_5,mes_6,mes_7,mes_8,mes_9,default
0,5008804,M,Y,Y,0,427500.0,Working,Higher education,Civil marriage,Rented apartment,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
1,5008805,M,Y,Y,0,427500.0,Working,Higher education,Civil marriage,Rented apartment,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
2,5008806,M,Y,Y,0,112500.0,Working,Secondary / secondary special,Married,House / apartment,...,C,C,NaN,0,NaN,NaN,NaN,0,NaN,0.0
3,5008808,F,N,Y,0,270000.0,Commercial associate,Secondary / secondary special,Single / not married,House / apartment,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
4,5008809,F,N,Y,0,270000.0,Commercial associate,Secondary / secondary special,Single / not married,House / apartment,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
438552,6840104,M,N,Y,0,135000.0,Pensioner,Secondary / secondary special,Separated,House / apartment,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
438553,6840222,F,N,N,0,103500.0,Working,Secondary / secondary special,Single / not married,House / apartment,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
438554,6841878,F,N,N,0,54000.0,Commercial associate,Higher education,Single / not married,With parents,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
438555,6842765,F,N,Y,0,72000.0,Pensioner,Secondary / secondary special,Married,House / apartment,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
438556,6842885,F,N,Y,0,121500.0,Working,Secondary / secondary special,Married,House / apartment,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN

In [52]:
propostas.merge(pg2, on='ID', how='left').value_counts()

ID       CODE_GENDER  FLAG_OWN_CAR  FLAG_OWN_REALTY  CNT_CHILDREN  AMT_INCOME_TOTAL  NAME_INCOME_TYPE      NAME_EDUCATION_TYPE            NAME_FAMILY_STATUS  NAME_HOUSING_TYPE  DAYS_BIRTH  DAYS_EMPLOYED  FLAG_MOBIL  FLAG_WORK_PHONE  FLAG_PHONE  FLAG_EMAIL  OCCUPATION_TYPE  CNT_FAM_MEMBERS  mes_0  mes_1  mes_10  mes_11  mes_12  mes_13  mes_14  mes_15  mes_16  mes_17  mes_18  mes_19  mes_2  mes_20  mes_21  mes_22  mes_23  mes_24  mes_3  mes_4  mes_5  mes_6  mes_7  mes_8  mes_9  default
5008825  F            Y             N                0             130500.0          Working               Incomplete higher              Married             House / apartment  -10669      -1103          1           0                0           0           Accountants      2.0              0      0      0       0       0       0       0       0       0       0       0       0       0      0       0       0       0       0       0      0      1      0      0      0      0      0.0        1
5105171  M            N             Y                2             450000.0          Commercial associate  Higher education               Married             House / apartment  -12238      -2187          1           1                1           0           Managers         4.0              0      0      C       C       C       C       C       C       C       C       C       C       0      C       C       C       C       C       0      0      C      C      C      C      C      0.0        1
5105169  M            N             Y                2             450000.0          Commercial associate  Higher education               Married             House / apartment  -12238      -2187          1           1                1           0           Managers         4.0              0      0      C       C       C       C       C       C       C       C       C       C       0      C       C       C       C       C       0      0      C      C      C      C      C      0.0        1
5105168  M            N             Y                2             450000.0          Commercial associate  Higher education               Married             House / apartment  -12238      -2187          1           1                1           0           Managers         4.0              0      0      0       C       C       C       C       C       C       C       C       C       0      C       C       C       C       C       0      0      0      0      0      0      0      0.0        1
5105166  M            N             Y                2             450000.0          Commercial associate  Higher education               Married             House / apartment  -12238      -2187          1           1                1           0           Managers         4.0              0      0      0       C       C       C       C       C       C       C       C       C       0      C       C       C       C       C       0      0      0      0      0      0      0      0.0        1
                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                           ..
5053553  M            Y             Y                1             193500.0          Working               Secondary / secondary special  Married             House / apartment  -10439      -2250          1           1                0           0           Core staff       3.0              0      0      0       0       C       C       C       C       C       C       C       C       0      C       C       C       C       C       0      0      0      0      0      0      0      0.0        1
5053550  M            Y             Y                1             193500.0          Working               Secondary / secondary special  Married             House / apartment  -10439      -2250          1           1                0           0           Core staff       3.0              0      0      0       0       C       C       C       C       C       C       C       C       0      C       C       C       C       C       0      0      0      0      0      0      0      0.0        1
5053548  M            Y             Y                0             135000.0          Working               Secondary / secondary special  Married             House / apartment  -21065      -1458          1           0                1           0           Laborers         2.0              0      0      C       C       C       C       C       C       C       C       C       C       0      C       C       C       C       C       C      C      C      C      C      C      C      0.0        1
5053545  M            Y             Y                0             135000.0          Working               Secondary / secondary special  Married             House / apartment  -21065      -1458          1           0                1           0           Laborers         2.0              0      0      0       0       0       0       0       0       0       0       0       0       0      0       0       0       0       0       0      0      0      0      0      0      0      0.0        1
5150487  M            Y             N                0             202500.0          Working               Secondary / secondary special  Married             House / apartment  -19398      -2166          1           0                0           0           Drivers          2.0              C      C      C       C       C       C       C       C       C       C       C       C       C      C       C       C       C       C       C      C      C      C      C      C      C      0.0        1
Length: 6334, dtype: int64

In [57]:
p.default.value_counts()

0     20506
1       175
2        69
3        48
4        28
6        19
5        17
12       13
8        10
10        7
18        6
15        5
13        4
20        4
9         4
7         4
14        4
24        3
19        3
11        3
16        2
17        2
23        1
Name: default, dtype: int64